# <center>Основы pandas

# Содержание
* [Установка необходимых библиотек](#1) ***pandas*** lxml bs4 html5lib
* [подключение библиотеки](#2)
* [Импорт данных из файла](#3) ```pd.read_csv```
* [Упражнение 1](#4) ```загрузить этот файл в датафрейм и посчитать его размеры```
* [Основные сведения о датафрейме](#5) ```метод .info()```
* [Отдельный столбец (тип Series)](#6) ``` ```
* [Уникальные значения в столбце](#7)  ```unique() или nunique() - вместе с len() ```
* [Упражнение 2](#8) ```Определите какой товар (столбец Product) упоминается в файле чаще всего?```
* [Фильтры](#9) ```метод .filter()```
    * [Выбрать несколько столбцов](#9.1) ``` ```
    * [Отфильтруем строки с потреблением выше среднего](#9.2) ``` ```
* [Строки с потреблением больше среднего](#12) ``` ```
    * [Самый популярный способ](#12.1) ``` ```
* [Как определить используемый вариант названия страны?](#13) ``` ```
* [Сортировка](#14) ```метод .sort_values()```
* [Параметр inplace](#15) ```= rewrite```
* [Задание 1](#16) ```Определите какому фильму было выставлено больше всего оценок 5.0``` 
* [Задание 2](#17) <br>
```посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.```
* [Задание 3](#18)  <br>
```Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe. Примеры страниц (необязательно брать именно эти)```

# Установка необходимых библиотек <a class="anchor" id="1"></a>

In [2]:
!pip3 install pandas

Collecting pandas
  Downloading pandas-1.5.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (12.1 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 12.1/12.1 MB 63.0 MB/s eta 0:00:00m eta 0:00:01:01:01
Requirement already satisfied: python-dateutil>=2.8.1 in /home/rain/Jupyter/jup_venv/lib/python3.10/site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1
  Downloading pytz-2022.7-py2.py3-none-any.whl (499 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 499.4/499.4 kB 86.6 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.21.0 in /home/rain/Jupyter/jup_venv/lib/python3.10/site-packages (from pandas) (1.24.0)
Requirement already satisfied: six>=1.5 in /home/rain/Jupyter/jup_venv/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-1.5.2 pytz-2022.7

In [1]:
!pip3 reinstall lxml bs4 html5lib

# подключение библиотеки <a class="anchor" id="2"></a>

In [1]:
import pandas as pd

In [11]:
pd.__version__

'2.0.2'

Пример забора данных с сайтов

In [5]:
url = 'https://cbr.ru/currency_base/daily/'
pd.read_html(url, decimal=',', thousands='.')

[    Цифр. код Букв. код  Единиц                                    Валюта  \
 0          36       AUD       1                      Австралийский доллар
 1         944       AZN       1                     Азербайджанский манат
 2          51       AMD     100                          Армянских драмов
 3         933       BYN       1                         Белорусский рубль
 4         975       BGN       1                            Болгарский лев
 5         986       BRL       1                          Бразильский реал
 6         348       HUF     100                       Венгерских форинтов
 7         410       KRW    1000                      Вон Республики Корея
 8         704       VND   10000                        Вьетнамских донгов
 9         344       HKD       1                        Гонконгский доллар
 10        981       GEL       1                           Грузинский лари
 11        208       DKK       1                             Датская крона
 12        784       AED       1                                Дирхам ОАЭ
 13        840       USD       1                                Доллар США
 14        978       EUR       1                                      Евро
 15        818       EGP      10                         Египетских фунтов
 16        356       INR      10                           Индийских рупий
 17        360       IDR   10000                       Индонезийских рупий
 18        398       KZT     100                       Казахстанских тенге
 19        124       CAD       1                          Канадский доллар
 20        634       QAR       1                            Катарский риал
 21        417       KGS     100                          Киргизских сомов
 22        156       CNY       1                            Китайский юань
 23        498       MDL      10                           Молдавских леев
 24        554       NZD       1                     Новозеландский доллар
 25        934       TMT       1                   Новый туркменский манат
 26        578       NOK      10                           Норвежских крон
 27        985       PLN       1                           Польский злотый
 28        946       RON       1                             Румынский лей
 29        960       XDR       1     СДР (специальные права заимствования)
 30        941       RSD     100                          Сербских динаров
 31        702       SGD       1                       Сингапурский доллар
 32        972       TJS      10                         Таджикских сомони
 33        764       THB      10                         Таиландских батов
 34        949       TRY      10                              Турецких лир
 35        860       UZS   10000                           Узбекских сумов
 36        980       UAH      10                         Украинских гривен
 37        826       GBP       1  Фунт стерлингов Соединенного королевства
 38        203       CZK      10                              Чешских крон
 39        752       SEK      10                             Шведских крон
 40        756       CHF       1                         Швейцарский франк
 41        710       ZAR      10                    Южноафриканских рэндов
 42        392       JPY     100                              Японских иен

        Курс
 0    569025
 1    503642
 2    221507
 3    283987
 4    479391
 5    178746
 6    252967
 7    654932
 8    360350
 9    109515
 10   325734
 11   125898
 12   233104
 13   856192
 14   938644
 15   277113
 16   104293
 17   569807
 18   190113
 19   649861
 20   235218
 21   980635
 22   117958
 23   470464
 24   524418
 25   244626
 26   791422
 27   208996
 28   189101
 29  1144121
 30   799591
 31   633888
 32   784511
 33   241870
 34   331262
 35   745285
 36   231859
 37  1091302
 38   397305
 39   798828
 40   953656
 41   458612
 42   594950  ]

In [9]:
# decimal=',', thousands='.' потому что не считывает запятые
pd.read_html(url, decimal=',', thousands='.')[0]

,Цифр. код,Букв. код,Единиц,Валюта,Курс
0,36,AUD,1,Австралийский доллар,56.9025
1,944,AZN,1,Азербайджанский манат,50.3642
2,51,AMD,100,Армянских драмов,22.1507
3,933,BYN,1,Белорусский рубль,28.3987
4,975,BGN,1,Болгарский лев,47.9391
5,986,BRL,1,Бразильский реал,17.8746
6,348,HUF,100,Венгерских форинтов,25.2967
7,410,KRW,1000,Вон Республики Корея,65.4932
8,704,VND,10000,Вьетнамских донгов,36.0350
9,344,HKD,1,Гонконгский доллар,10.9515
10,981,GEL,1,Грузинский лари,32.5734
11,208,DKK,1,Датская крона,12.5898
12,784,AED,1,Дирхам ОАЭ,23.3104
13,840,USD,1,Доллар США,85.6192
14,978,EUR,1,Евро,93.8644
15,818,EGP,10,Египетских фунтов,27.7113
16,356,INR,10,Индийских рупий,10.4293
17,360,IDR,10000,Индонезийских рупий,56.9807
18,398,KZT,100,Казахстанских тенге,19.0113
19,124,CAD,1,Канадский доллар,64.9861
20,634,QAR,1,Катарский риал,23.5218
21,417,KGS,100,Киргизских сомов,98.0635
22,156,CNY,1,Китайский юань,11.7958
23,498,MDL,10,Молдавских леев,47.0464
24,554,NZD,1,Новозеландский доллар,52.4418
25,934,TMT,1,Новый туркменский манат,24.4626
26,578,NOK,10,Норвежских крон,79.1422
27,985,PLN,1,Польский злотый,20.8996
28,946,RON,1,Румынский лей,18.9101
29,960,XDR,1,СДР (специальные права заимствования),114.4121
30,941,RSD,100,Сербских динаров,79.9591
31,702,SGD,1,Сингапурский доллар,63.3888
32,972,TJS,10,Таджикских сомони,78.4511
33,764,THB,10,Таиландских батов,24.1870
34,949,TRY,10,Турецких лир,33.1262
35,860,UZS,10000,Узбекских сумов,74.5285
36,980,UAH,10,Украинских гривен,23.1859
37,826,GBP,1,Фунт стерлингов Соединенного королевства,109.1302
38,203,CZK,10,Чешских крон,39.7305
39,752,SEK,10,Шведских крон,79.8828
40,756,CHF,1,Швейцарский франк,95.3656
41,710,ZAR,10,Южноафриканских рэндов,45.8612
42,392,JPY,100,Японских иен,59.4950

In [26]:
pd.read_html('https://ru.investing.com/crypto', 
             attrs = {'id': 'DataTables_Table_0_wrapper'},
             encoding='utf-8')

HTTPError: HTTP Error 403: Forbidden

In [16]:
page_url = 'https://cbr.ru'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

/home/rain/main_env/lib/python3.10/site-packages/bs4/__init__.py:226: UserWarning: You provided Unicode markup but also provided a value for from_encoding. Your from_encoding will be ignored.
  warnings.warn("You provided Unicode markup but also provided a value for from_encoding. Your from_encoding will be ignored.")

ValueError: No tables found

### Импорт данных из файла <a class="anchor" id="3"></a>

In [42]:
data = pd.read_csv('../.datasets/power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [29]:
data.tail()

          country  year  quantity  category
1189477  Viet Nam  2012      92.0        71
1189478  Viet Nam  2011      87.0        71
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

In [30]:
type(data)

pandas.core.frame.DataFrame

In [43]:
# если надо указать свои заголовки и разделитель
#?pd.read_csv
buf = pd.read_csv(filepath_or_buffer='../.datasets/power.csv', 
                  names = ['страна', 'год', 'количество', 'категория'], 
                  sep = ',', header=0)
buf.head()

    страна   год  количество  категория
0  Austria  1996         5.0          1
1  Austria  1995        17.0          1
2  Belgium  2014         0.0          1
3  Belgium  2013         0.0          1
4  Belgium  2012        35.0          1

In [38]:
# количество строк в датафрейме
len(data)

1189482

In [39]:
# или так
data.shape

(1189482, 4)

Простые вычисления для нового столбца

In [44]:
data['year_plus_one'] = data['year'] + 1
data.head()

   country  year  quantity  category  year_plus_one
0  Austria  1996       5.0         1           1997
1  Austria  1995      17.0         1           1996
2  Belgium  2014       0.0         1           2015
3  Belgium  2013       0.0         1           2014
4  Belgium  2012      35.0         1           2013

### Упражнение 1 <a class="anchor" id="4"></a>
Вам дана статистика продаж в файле transactions.csv. Вам необходимо загрузить этот файл в датафрейм и посчитать его размеры.

In [45]:
transactions = pd.read_csv('../.datasets/transactions.csv')
transactions.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [46]:
transactions.tail()

    Year  Month    ID Product  Amount  Price  Total  Cost
55  2017     12  t056      _4       2   8618  17236  1200
56  2017     12  t057      _2       8   1896  15168  1200
57  2017     12  t058      _5       2   5175  10350   200
58  2017     12  t059      _8       3   3760  11280   800
59  2017     12  t060      _3       4   1265   5060   700

In [47]:
transactions.shape

(60, 8)

### Основные сведения о датафрейме <a class="anchor" id="5"></a>

In [48]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 5 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   country        1189482 non-null  object
 1   year           1189482 non-null  int64
 2   quantity       1189482 non-null  float64
 3   category       1189482 non-null  int64
 4   year_plus_one  1189482 non-null  int64
dtypes: float64(1), int64(3), object(1)
memory usage: 45.4+ MB

In [49]:
# немного статистики
data.describe()

               year      quantity      category  year_plus_one
count  1.189482e+06  1.189482e+06  1.189482e+06   1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01   2.003852e+03
std    7.167345e+00  1.585663e+07  1.809968e+01   7.167345e+00
min    1.990000e+03 -8.643480e+05  1.000000e+00   1.991000e+03
25%    1.997000e+03  1.400000e+01  2.400000e+01   1.998000e+03
50%    2.003000e+03  1.890000e+02  3.500000e+01   2.004000e+03
75%    2.009000e+03  2.265000e+03  5.100000e+01   2.010000e+03
max    2.014000e+03  6.680329e+09  7.100000e+01   2.015000e+03

### Отдельный столбец (тип Series) <a class="anchor" id="6"></a>

In [15]:
data['year'].head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

или так

In [50]:
data.year.head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [17]:
type(data['year'])

pandas.core.series.Series

In [18]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [59]:
data.tail()

          country  year  quantity  category  year_plus_one
1189477  Viet Nam  2012      92.0        71           2013
1189478  Viet Nam  2011      87.0        71           2012
1189479  Viet Nam  2010      50.0        71           2011
1189480  Viet Nam  2009      10.0        71           2010
1189481  Viet Nam  2008       1.0        71           2009

# Уникальные значения в столбце <a class="anchor" id="7"></a>

In [51]:
data['category'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 13, 12, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71])

их кол-во

In [52]:
len(data['category'].unique())

71

In [58]:
data['category'].head()

0    1
1    1
2    1
3    1
4    1
Name: category, dtype: int64

In [66]:
# распределение количества строк по значениям столбца
data['category'].value_counts().sort_values(ascending=False).head(10)

category
67    133916
27     97645
24     75132
42     64161
37     62156
39     53198
25     52032
21     50229
51     43466
31     42307
Name: count, dtype: int64

In [67]:
data['category'].value_counts(normalize=True).head()

category
67    0.112583
27    0.082090
24    0.063164
42    0.053940
37    0.052255
Name: proportion, dtype: float64

### Упражнение 2 <a class="anchor" id="8"></a>
Используем файл transactions.csv. Определите какой товар (столбец Product) упоминается в файле чаще всего?

In [24]:
transactions = pd.read_csv('../.datasets/transactions.csv')
transactions.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [27]:
transactions['Product'].value_counts()

_5    11
_8     8
_2     8
_3     7
_4     7
A1     5
A4     5
A5     5
A2     2
_6     2
Name: Product, dtype: int64

In [68]:
transactions['Product'].value_counts()[0]

11

выведем самый популярный продукт

In [77]:
transactions['Product'].value_counts().index[0]

'_5'

# Фильтры <a class="anchor" id="9"></a>

In [78]:
data = pd.read_csv('../.datasets/power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

# Выбрать несколько столбцов <a class="anchor" id="9.1"></a>

In [79]:
country_stats = data.filter(items = ['country', 'quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

или так

In [30]:
data[['country', 'quantity']].head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

# Отфильтруем строки с потреблением выше среднего <a class="anchor" id="9.2"></a>

In [80]:
average_level = data['quantity'].mean()
average_level

184264.77005012863

In [81]:
'quantity > {}'.format(average_level)

'quantity > 184264.77005012863'

In [82]:
data['quantity'].mean()

184264.77005012863

# Строки с потреблением больше среднего <a class="anchor" id="12"></a>

In [83]:
average_level = data['quantity'].mean()
country_stats.query(f'quantity > {average_level}').head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

# Самый популярный способ <a class="anchor" id="12.1"></a>

In [84]:
data[data.quantity > average_level].head()

            country  year  quantity  category
3228  United States  2014  367987.0         2
3229  United States  2013  384439.0         2
3230  United States  2012  370625.0         2
3231  United States  2011  310909.0         2
3232  United States  2010  335418.0         2

# Как определить используемый вариант названия страны? <a class="anchor" id="13"></a>

In [85]:
data['country'].unique()

array(['Austria', 'Belgium', 'Czechia', 'Finland', 'France', 'Greece',
       'Hungary', 'Italy', 'Korea, Republic of', 'Netherlands', 'Romania',
       'Serbia', 'Slovakia', 'Ukraine', 'United Kingdom', 'United States',
       'Brunei Darussalam', 'Bulgaria', 'Canada', 'Chile', 'Croatia',
       'Iran (Islamic Rep. of)', 'Jordan', 'Lithuania', 'Mexico', 'Oman',
       'Other Asia', 'Poland', 'Portugal', 'Spain', 'Sweden',
       'Switzerland', 'T.F.Yug.Rep. Macedonia', 'Turkey', 'Uzbekistan',
       'Argentina', 'Colombia', 'Germany', 'Norway', 'Australia',
       'China, Macao SAR', 'Japan', 'Denmark', 'Ireland', 'Philippines',
       'Bangladesh', 'Eritrea', 'Ethiopia', 'Lesotho', 'Nepal', 'Niger',
       'Pakistan', 'Serbia and Montenegro', 'Tunisia', 'Botswana',
       'Georgia', 'Republic of Moldova', 'Peru', 'South Africa',
       'Iceland', 'Latvia', 'Luxembourg', 'Cuba', 'Kyrgyzstan',
       'Singapore', 'Thailand', 'United Arab Emirates', 'Uruguay',
       'Armenia', 'Fiji', "Korea, Dem.Ppl's.Rep.", 'Russian Federation',
       'Swaziland', 'Zimbabwe', 'Afghanistan', 'Antigua and Barbuda',
       'Azerbaijan', 'Bahamas', 'Belize', 'Bolivia (Plur. State of)',
       'Brazil', 'Burkina Faso', 'Cameroon', 'Cayman Islands',
       'Central African Rep.', 'China', 'Comoros', 'Congo', 'Costa Rica',
       "Côte d'Ivoire", 'Dem. Rep. of the Congo', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Estonia',
       'Ethiopia, incl. Eritrea', 'Faeroe Islands', 'French Guiana',
       'Germany, Fed. R. (former)', 'Greenland', 'Guatemala', 'Guinea',
       'Guyana', 'Honduras', 'Indonesia', 'Israel', 'Jamaica', 'Jersey',
       'Kazakhstan', 'Kenya', 'Kuwait', "Lao People's Dem. Rep.",
       'Liberia', 'Libya', 'Malawi', 'Malaysia', 'Maldives', 'Mauritania',
       'Mayotte', 'Morocco', 'Myanmar', 'Namibia', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niue', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Sao Tome and Principe', 'Senegal', 'Seychelles',
       'Slovenia', 'Solomon Islands', 'Sri Lanka', 'Sudan (former)',
       'Suriname', 'Togo', 'Tonga', 'Trinidad and Tobago',
       'United Rep. of Tanzania', 'Venezuela (Bolivar. Rep.)',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria', 'Curaçao',
       'Gabon', 'Malta', 'Neth. Antilles (former)', 'Sierra Leone',
       'USSR (former)', 'Barbados', 'Benin', 'Chad', 'Djibouti',
       'French Polynesia', 'Ghana', 'Grenada', 'Guadeloupe', 'Haiti',
       'Iraq', 'Kiribati', 'Madagascar', 'Mali', 'Martinique',
       'Pacific Islands (former)', 'Palau', 'St. Helena and Depend.',
       'St. Vincent-Grenadines', 'Syrian Arab Republic', 'Uganda',
       'Yemen', 'Yemen, Dem. (former)', 'Burundi', 'India', 'Mauritius',
       'Mozambique', 'Nigeria', 'Réunion', 'Rwanda', 'Samoa', 'Somalia',
       'St. Kitts-Nevis', 'Viet Nam', 'Belarus', 'Cyprus', 'Cabo Verde',
       'Albania', 'Bahrain', 'Bosnia and Herzegovina',
       'China, Hong Kong SAR', 'Czechoslovakia (former)', 'Angola',
       'Bermuda', 'Bhutan', 'Equatorial Guinea', 'Lebanon',
       'Saudi Arabia', 'St. Lucia', 'St. Pierre-Miquelon',
       'State of Palestine', 'Tajikistan', 'German Dem. R. (former)',
       'Anguilla', 'Mongolia', 'Montenegro', 'Cambodia', 'South Sudan',
       'Sudan', 'Andorra', 'Aruba', 'Bonaire, St Eustatius, Saba',
       'British Virgin Islands', 'Dominica', 'Falkland Is. (Malvinas)',
       'Gambia', 'Gibraltar', 'Qatar', 'Sint Maarten (Dutch part)',
       'Turkmenistan', 'Turks and Caicos Islands', 'Vanuatu',
       'Guinea-Bissau', 'Micronesia (Fed. States of)', 'Timor-Leste',
       'Yemen Arab Rep. (former)', 'American Samoa', 'Liechtenstein',
       'Puerto Rico', 'Cook Islands', 'Guam', 'Guernsey', 'Isle of Man',
       'Marshall Islands', 'Montserrat', 'Nauru',
       'Northern Mariana Islands', 'Tuvalu', 'United States Virgin Is.',
       'Wallis and Futuna Is.',
       'Commonwealth of Independent States (CIS)', 'Antarctic Fisheries'],
      dtype=object)

найдем как называется Россия и Беларусь в этом датафрейме

фильтр на подстроку - смотрим все страны, содержащие в названии 'us'

In [86]:
data[ data['country'].str.contains('us', case=False) ]['country'].unique()

array(['Austria', 'Brunei Darussalam', 'Australia', 'Russian Federation',
       'USSR (former)', 'Mauritius', 'Belarus', 'Cyprus',
       'Bonaire, St Eustatius, Saba'], dtype=object)

```
# фильтр на несколько условий сразу
# | - условие ИЛИ
# & AND
# () | (() | () & ())
```

In [88]:
filtered_countries = data[(data['country']=='Russian Federation') | (data['country']=='Belarus')]
filtered_countries.head()

                 country  year  quantity  category
6940  Russian Federation  2014   12714.0         3
6941  Russian Federation  2013   11285.0         3
6942  Russian Federation  2012   11302.0         3
6943  Russian Federation  2011    7611.0         3
6944  Russian Federation  2010    9263.0         3

In [39]:
filtered_countries['country'].unique()

array(['Russian Federation', 'Belarus'], dtype=object)

In [41]:
data[data.country.isin(['Russian Federation','Belarus'])]

                    country  year  quantity  category
6940     Russian Federation  2014   12714.0         3
6941     Russian Federation  2013   11285.0         3
6942     Russian Federation  2012   11302.0         3
6943     Russian Federation  2011    7611.0         3
6944     Russian Federation  2010    9263.0         3
...                     ...   ...       ...       ...
1189189  Russian Federation  2001       3.0        71
1189190  Russian Federation  2000       2.0        71
1189191  Russian Federation  1999       2.0        71
1189192  Russian Federation  1998       0.0        71
1189193  Russian Federation  1997       0.0        71

[23697 rows x 4 columns]

In [43]:
# фильтры на номер строки
print(len(data.loc[1000:1005]))
data.loc[1000:1005]

6

      country  year  quantity  category
1000  Austria  1998     -14.0         1
1001  Austria  1997       5.0         1
1002  Austria  1996      -1.0         1
1003  Austria  1995     -10.0         1
1004  Austria  1994      -8.0         1
1005  Austria  1993     -11.0         1

# Сортировка <a class="anchor" id="14"></a>

Сортировка по столбцу

In [89]:
data.sort_values(by='quantity').head()

              country  year  quantity  category
832375  United States  2000 -864348.0        42
832373  United States  2002 -562414.0        42
832362  United States  2013 -551490.0        42
832380  United States  1995 -493380.0        42
832322        Ukraine  2010 -477263.0        42

сортировка по убыванию

In [90]:
data.sort_values('quantity', ascending=False).head()

              country  year      quantity  category
492581  United States  2014  6.680329e+09        31
492267  United States  2014  6.680329e+09        31
492047          China  2014  5.462672e+09        31
492345          China  2014  5.462672e+09        31
122392  USSR (former)  1990  3.257000e+09        12

сортировка по нескольким столбцам

In [92]:
data.sort_values(by=['year', 'country', 'quantity'], ascending=[False, True, False])

             country  year      quantity  category
835127   Afghanistan  2014  1.935442e+06        42
491541   Afghanistan  2014  6.600000e+04        31
492004   Afghanistan  2014  6.600000e+04        31
492292   Afghanistan  2014  6.600000e+04        31
791301   Afghanistan  2014  5.537080e+03        42
...              ...   ...           ...       ...
521819      Zimbabwe  1990  0.000000e+00        31
727864      Zimbabwe  1990  0.000000e+00        39
901003      Zimbabwe  1990  0.000000e+00        51
1039388     Zimbabwe  1990  0.000000e+00        67
1052123     Zimbabwe  1990  0.000000e+00        67

[1189482 rows x 4 columns]

In [97]:
data.sort_values(by=['year', 'country', 'quantity'], ascending=[False, True, False]).index

Index([ 835127,  491541,  492004,  492292,  791301,  797879,  811493,  813883,
        820564,  828390,
       ...
        136544,  140374,  146170,  150366,  432305,  521819,  727864,  901003,
       1039388, 1052123],
      dtype='int64', length=1189482)

In [99]:
data.sort_values(by=['year', 'country', 'quantity'], ascending=[False, True, False]).index[60]

384894

Вывести строку по нужному индексу, в примере ***data.sort_values(by=['year', 'country', 'quantity'], ascending=[False, True, False]).index[60]***

In [101]:
data.sort_values(by=['year', 'country', 'quantity'], ascending=[False, True, False])\
.iloc[[data.sort_values(by=['year', 'country', 'quantity'], ascending=[False, True, False]).index[60]]]

         country  year  quantity  category
180204  Viet Nam  2008   14904.0        18

# Параметр inplace <a class="anchor" id="15"></a>

In [102]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [ ]:
data.sort_values('country', ascending=True, inplace=rewrite)

In [ ]:
data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])
# чтобы сократить это выражение используем inplace:
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)

### Упражнение
Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?

In [103]:
transactions = pd.read_csv('../.datasets/transactions.csv')
transactions.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [104]:
transactions[['ID','Product', 'Cost']]

      ID Product  Cost
0   t001      A1  1200
1   t002      A2  1100
2   t003      A1  1200
3   t004      A4  4200
4   t005      A5   500
5   t006      _6   200
6   t007      _3   200
7   t008      _5  1200
8   t009      _8  1000
9   t010      _4  3400
10  t011      _2   800
11  t012      _5   700
12  t013      _8  1200
13  t014      _4   250
14  t015      _2   650
15  t016      A4  2400
16  t017      A5  1200
17  t018      _6  1200
18  t019      _3   200
19  t020      _5   800
20  t021      _3   700
21  t022      _5  4200
22  t023      _8   200
23  t024      _4  1200
24  t025      _2   250
25  t026      _5   650
26  t027      _8   800
27  t028      _4   700
28  t029      _2  1200
29  t030      A4   250
30  t031      _2   650
31  t032      A4  2400
32  t033      A5  1200
33  t034      _3  1000
34  t035      _5   800
35  t036      _3  2400
36  t037      _5   200
37  t038      _8   700
38  t039      _4  2400
39  t040      _2  1000
40  t041      _5   800
41  t042      _8   800
42  t043      _4   200
43  t044      _5   700
44  t045      _3   250
45  t046      _5   650
46  t047      A5  2400
47  t048      A1  1200
48  t049      A2  1200
49  t050      A1   200
50  t051      A4   800
51  t052      A5   700
52  t053      _2   250
53  t054      A1   650
54  t055      _8  2400
55  t056      _4  1200
56  t057      _2  1200
57  t058      _5   200
58  t059      _8   800
59  t060      _3   700

Выведем транзакции в категории(продукта) ***_8***, отсортируем по ***Cost*** и выведем столбец ***ID***

In [105]:
transactions[transactions['Product'] == '_8'].sort_values('Cost', ascending=False)['ID']

54    t055
12    t013
8     t009
26    t027
41    t042
58    t059
37    t038
22    t023
Name: ID, dtype: object

Выведем самое первое значение, т.е. самую затратную

In [106]:
transactions[transactions['Product'] == '_8'].sort_values('Cost', ascending=False)['ID'].values[0]

't055'

In [107]:
type(transactions[transactions['Product'] == '_8'].sort_values('Cost', ascending=False))

pandas.core.frame.DataFrame

In [108]:
type(transactions[transactions['Product'] == '_8'].sort_values('Cost', ascending=False)['ID'].head(1))

pandas.core.series.Series

In [109]:
max(transactions[transactions['Product'] == '_8']['Cost']), type(max(transactions[transactions['Product'] == '_8']['Cost']))

(2400, int)

Выберем транзакции в категории(продукта) _8 и выведем столбец ***Cost***

In [110]:
transactions[transactions['Product'] == '_8']['Cost']

8     1000
12    1200
22     200
26     800
37     700
41     800
54    2400
58     800
Name: Cost, dtype: int64

# Задание 1 <a class="anchor" id="16"></a>
### Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [2]:
movies = pd.read_csv('../.datasets/movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [3]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62423 entries, 0 to 62422
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  62423 non-null  int64
 1   title    62423 non-null  object
 2   genres   62423 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.4+ MB

In [3]:
ratings = pd.read_csv('../.datasets/ratings.csv')
ratings.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [5]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25000095 entries, 0 to 25000094
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   rating     float64
 3   timestamp  int64
dtypes: float64(1), int64(3)
memory usage: 762.9 MB

In [25]:
ratings[['movieId','rating' ]].value_counts(777777777777)???????????????????????????????//

movieId  rating
318      5.0       48762
296      5.0       37458
356      5.0       32009
260      5.0       31385
593      5.0       30280
                   ...
120240   4.5           1
120236   3.0           1
120224   3.5           1
120222   4.0           1
193886   4.0           1
Length: 272286, dtype: int64

In [27]:
ratings[['movieId','rating' ]].value_counts().info()

<class 'pandas.core.series.Series'>
MultiIndex: 272286 entries, (318, 5.0) to (193886, 4.0)
Series name: None
Non-Null Count   Dtype
--------------   -----
272286 non-null  int64
dtypes: int64(1)
memory usage: 3.8 MB

In [60]:
len(ratings[ratings['rating'] == 5.0 ])

4071135

In [68]:
ratings[ratings['rating'] == 5.0 ]

          userId  movieId  rating   timestamp
40             3     2028     5.0   945141611
61             4       47     5.0  1113767129
107            4      296     5.0  1113767056
109            4      316     5.0  1113767120
111            4      318     5.0  1113766505
...          ...      ...     ...         ...
27753429  283228     6377     5.0  1379882837
27753431  283228     7072     5.0  1379882920
27753436  283228     7831     5.0  1379882907
27753437  283228     7834     5.0  1379882865
27753438  283228     8228     5.0  1354137317

[4071135 rows x 4 columns]

In [72]:
buf = ratings[ratings['rating'] == 5.0 ]

In [112]:
buf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4071135 entries, 40 to 27753438
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   rating     float64
 3   timestamp  int64
dtypes: float64(1), int64(3)
memory usage: 155.3 MB

In [4]:
?pd.value_counts

In [115]:
buf[['rating', 'movieId']].value_counts()

rating  movieId
5.0     318        48762
        296        37458
        356        32009
        260        31385
        593        30280
                   ...
        114382         1
        114373         1
        114363         1
        114353         1
        193874         1
Length: 24209, dtype: int64

In [110]:
buf[['movieId','rating' ]].value_counts()

movieId  rating
318      5.0       48762
296      5.0       37458
356      5.0       32009
260      5.0       31385
593      5.0       30280
                   ...
114382   5.0           1
114373   5.0           1
114363   5.0           1
114353   5.0           1
193874   5.0           1
Length: 24209, dtype: int64

In [151]:
mv = buf[['rating','movieId' ]]

In [152]:
mv.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4071135 entries, 40 to 27753438
Data columns (total 2 columns):
 #   Column   Dtype
---  ------   -----
 0   rating   float64
 1   movieId  int64
dtypes: float64(1), int64(1)
memory usage: 93.2 MB

In [153]:
mv.value_counts(), type(mv.value_counts())

(rating  movieId
 5.0     318        48762
         296        37458
         356        32009
         260        31385
         593        30280
                    ...
         114382         1
         114373         1
         114363         1
         114353         1
         193874         1
 Length: 24209, dtype: int64,
 pandas.core.series.Series)

In [154]:
mv[mv['movieId'] == 318]

          rating  movieId
111          5.0      318
782          5.0      318
1537         5.0      318
2058         5.0      318
2113         5.0      318
...          ...      ...
27749722     5.0      318
27749767     5.0      318
27749828     5.0      318
27750127     5.0      318
27751767     5.0      318

[48762 rows x 2 columns]

In [123]:
movies[movies['movieId'] == 318]

     movieId                             title       genres
315      318  Shawshank Redemption, The (1994)  Crime|Drama

In [32]:
buf = ratings[ratings['rating'] == 5.0 ]
buf

          userId  movieId  rating   timestamp
0              1      296     5.0  1147880044
2              1      307     5.0  1147868828
3              1      665     5.0  1147878820
8              1     1237     5.0  1147868839
18             1     2632     5.0  1147878248
...          ...      ...     ...         ...
25000065  162541     5952     5.0  1240952617
25000067  162541     6104     5.0  1240953565
25000078  162541     7153     5.0  1240952613
25000080  162541     7193     5.0  1240950032
25000094  162541    63876     5.0  1240952515

[3612474 rows x 4 columns]

In [33]:
buf[['movieId','rating' ]]

          movieId  rating
0             296     5.0
2             307     5.0
3             665     5.0
8            1237     5.0
18           2632     5.0
...           ...     ...
25000065     5952     5.0
25000067     6104     5.0
25000078     7153     5.0
25000080     7193     5.0
25000094    63876     5.0

[3612474 rows x 2 columns]

In [30]:
buf[['movieId','rating' ]].value_counts()

movieId  rating
318      5.0       39553
296      5.0       32169
356      5.0       25918
260      5.0       25804
2571     5.0       25482
                   ...
147014   5.0           1
89377    5.0           1
147026   5.0           1
147033   5.0           1
209155   5.0           1
Name: count, Length: 27133, dtype: int64

In [24]:
buf[['movieId','rating' ]].value_counts().index[0][0]

318

In [27]:
ratings[ratings['rating'] == 5.0 ][['movieId','rating' ]].value_counts().index[0][0]

318

In [28]:
movies[movies['movieId'] == \
       ratings[ratings['rating'] == 5.0 ][['movieId','rating' ]].value_counts().index[0][0]]

     movieId                             title       genres
314      318  Shawshank Redemption, The (1994)  Crime|Drama

In [43]:
ratings[['movieId','rating']][(ratings.movieId==318)&(ratings.rating==5)].value_counts()

movieId  rating
318      5.0       39553
Name: count, dtype: int64

# Задание 2 <a class="anchor" id="17"></a>
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [2]:
def baltic(country):
    if country in ['Lithuania','Latvia','Estinia']:
        return 'Прибалтика'
    return 'other'

In [4]:
power = pd.read_csv('../.datasets/power.csv')
power

          country  year  quantity  category
0         Austria  1996       5.0         1
1         Austria  1995      17.0         1
2         Belgium  2014       0.0         1
3         Belgium  2013       0.0         1
4         Belgium  2012      35.0         1
...           ...   ...       ...       ...
1189477  Viet Nam  2012      92.0        71
1189478  Viet Nam  2011      87.0        71
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

[1189482 rows x 4 columns]

In [171]:
power[(power['category'].isin((4, 12, 21)))]

          country  year  quantity  category
9834    Swaziland  2014      0.15         4
9835    Swaziland  2013      0.15         4
9836    Swaziland  2012      0.15         4
9837    Swaziland  2011      0.15         4
9838    Swaziland  2010      0.18         4
...           ...   ...       ...       ...
254622   Viet Nam  2012     37.00        21
254623   Viet Nam  2011     31.00        21
254624   Viet Nam  2010     31.00        21
254625   Viet Nam  2009      8.00        21
254626   Viet Nam  2008      1.00        21

[88129 rows x 4 columns]

In [173]:
 power[power['year'].isin(range(2004, 2010+1))]

          country  year  quantity  category
6         Belgium  2010     22.00         1
7         Belgium  2009     45.00         1
10        Finland  2010      9.00         1
11        Finland  2009     13.00         1
12        Finland  2008     39.00         1
...           ...   ...       ...       ...
1189473   Vanuatu  2009      5.63        71
1189474   Vanuatu  2008      5.63        71
1189479  Viet Nam  2010     50.00        71
1189480  Viet Nam  2009     10.00        71
1189481  Viet Nam  2008      1.00        71

[360736 rows x 4 columns]

In [174]:
power[(power['category'].isin((4, 12, 21))) & power['year'].isin(range(2004, 2010+1))]

          country  year  quantity  category
9838    Swaziland  2010    0.1800         4
9839    Swaziland  2009    0.2100         4
9840    Swaziland  2008    0.3100         4
9841    Swaziland  2007    0.3080         4
9842    Swaziland  2006    0.2957         4
...           ...   ...       ...       ...
254615    Vanuatu  2009    2.4700        21
254616    Vanuatu  2008    2.4700        21
254624   Viet Nam  2010   31.0000        21
254625   Viet Nam  2009    8.0000        21
254626   Viet Nam  2008    1.0000        21

[25534 rows x 4 columns]

In [13]:
power[(power['category'].isin((4, 12, 21))) & power['year'].isin(range(2004, 2010+1)) 
      & power['country'].isin(('Lithuania','Latvia','Estinia'))]['quantity'].head()

11156    1.0
11157    0.0
11158    1.0
11159    1.0
11160    1.0
Name: quantity, dtype: float64

In [14]:
type(power[(power['category'].isin((4, 12, 21))) & power['year'].isin(range(2004, 2010+1)) 
      & power['country'].isin(('Lithuania','Latvia','Estinia'))]['quantity'].head())

pandas.core.series.Series

In [15]:
list(power[(power['category'].isin((4, 12, 21))) & power['year'].isin(range(2004, 2010+1)) 
      & power['country'].isin(('Lithuania','Latvia','Estinia'))]['quantity'].head())

[1.0, 0.0, 1.0, 1.0, 1.0]

In [18]:
s = 0
for i in list(power[(power['category'].isin((4, 12, 21))) & power['year'].isin(range(2004, 2010+1)) 
      & power['country'].isin(('Lithuania','Latvia','Estinia'))]['quantity']):
    #print(i)
    if i > 0:
        s += i
s

208712.0

# Задание 3 <a class="anchor" id="18"></a>
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [2]:
tables = pd.read_html(
    'https://ru.wikipedia.org/wiki/%D0%9F%D0%B0%D0%BD%D0%B4%D0%B5%D0%BC%D0%B8%D1%8F_COVID-19',
    match='стран')

In [3]:
tables

[                                    Пандемия COVID-19  \
 0   Медсестра готовит больного COVID-19 пациента к...
 1                                                 NaN
 2                                                 NaN
 3                                                 NaN
 4                                                 NaN
 5   .mw-parser-output .ts-Скрытый_блок{margin:0;ov...
 6   Карта общего количества подтверждённых случаев...
 7   Карта подтверждённых смертей на душу населения...
 8   Количество больных в странах с наивысшим уровн...
 9                                             Болезнь
 10                                        Возбудитель
 11                                       Место начала
 12                                        Дата начала
 13                             Подтверждённых случаев
 14                             Подтверждённых смертей
 15                          Оценка количества умерших
 16                           Медиафайлы на Викискладе

                                   Пандемия COVID-19.1
 0   Медсестра готовит больного COVID-19 пациента к...
 1                                                 NaN
 2                                                 NaN
 3                                                 NaN
 4                                                 NaN
 5   .mw-parser-output .ts-Скрытый_блок{margin:0;ov...
 6   Карта общего количества подтверждённых случаев...
 7   Карта подтверждённых смертей на душу населения...
 8   Количество больных в странах с наивысшим уровн...
 9                                            COVID-19
 10                                         SARS-CoV-2
 11  Ухань, Хубэй, Китай 30°37′11″ с. ш. 114°15′28″...
 12       с 17 ноября 2019 (3 года 2 месяца 6 дней)[1]
 13         по состоянию на 21.12.2022: 654 420 532[2]
 14           по состоянию на 21.12.2022: 6 669 455[2]
 15                                 9,5—21,6 млн[3][4]
 16                           Медиафайлы на Викискладе  ,
                                    Страны и территории  \
                                  Всего 000000000000000
 0                                                  NaN
 1                                                  NaN
 2                                                  NaN
 3                                                  NaN
 4                                                  NaN
 ..                                                 ...
 229  Морские суда, классифицируемые как международн...
 230                                                NaN
 231                                                NaN
 232                                         Примечания
 233  ↑ Всемирная организация здравоохранения опреде...

                                                         \
                                Всего 000000000000000.1
 0                                        США[141][142]
 1                                           Индия[143]
 2                                    Франция[144][145]
 3                                        Германия[146]
 4                                        Бразилия[147]
 ..                                                 ...
 229  Морские суда, классифицируемые как международн...
 230                                   Diamond Princess
 231                                   Zaandam[nl][310]
 232                                         Примечания
 233  ↑ Всемирная организация здравоохранения опреде...

                                               Заражено  \
                                            648 516 665
 0                                          100 743 392
 1                                           44 673 984
 2                                           37 916 052
 3                                           36 530 020
 4                                           35 336 482
 ..                                                 ...
 229  Морские суда, классифицируемые как международн...
 230                                                712
 231                                                  9
 232                                         Примечания
 233  ↑ Всемирная организация здравоохранения опреде...

                                                Выздор.  \
                                            626 263 547
 0                                           98 191 251
 1                                           44 137 617
 2                                           36 935 415
 3                                           35 853 000
 4                                           34 257 388
 ..                                                 ...
 229  Морские суда, классифицируемые как международн...
 230                                                699
 231                                                  7
 232                                         Примечания
 233  ↑ Всемирная организация здравоохранения опреде...

                                             Скончалось  \
                                              6 642 548
 0                                            1 106 378
 1                                              530 624
 2                                              159 026
 3                                              158 109
 4                                              689 998
 ..                                                 ...
 229  Морские суда, классифицируемые как международн...
 230                                                 13
 231                                                  2
 232                                         Примечания
 233  ↑ Всемирная организация здравоохранения опреде...

     .mw-parser-output .ts-comment-commentedText{border-bottom:1px dotted;cursor:help}@media(hover:none){.mw-parser-output .ts-comment-commentedText:not(.rt-commentedText){border-bottom:0;cursor:auto}}Летал.  \
                                                                                                                                                                                                          1,024
 0                                                 0011
 1                                                 1188
 2                                                 0419
 3                                                 0433
 4                                                 1953
 ..                                                 ...
 229  Морские суда, классифицируемые как международн...
 230                                               1826
 231                                              22222
 232                                         Примечания
 233  ↑ Всемирная организация здравоохранения опреде...

                                               На 1 млн  \
                                                  83199
 0                                               300901
 1                                                31760
 2                                               578125
 3                                               435485
 4                                               164086
 ..                                                 ...
 229  Морские суда, классифицируемые как международн...
 230                                                  —
 231                                                  —
 232                                         Примечания
 233  ↑ Всемирная организация здравоохранения опреде...

                                     Unnamed: 7_level_0
                                     Unnamed: 7_level_1
 0                                                  NaN
 1                                                  NaN
 2                                                  NaN
 3                                                  NaN
 4                                                  NaN
 ..                                                 ...
 229  Морские суда, классифицируемые как международн...
 230                                                NaN
 231                                                NaN
 232                                                NaN
 233                                                NaN

 [234 rows x 8 columns],
                                     Пандемия COVID-19  \
 0                                            Инфекция
 1                                            Варианты
 2                             Вакцины против COVID-19
 3   .mw-parser-output .ts-navbox-plaintitle{font-s...
 4                        Пандемия COVID-19 по странам
 5                                            Азия[en]
 6                                          Африка[en]
 7                                          Европа[en]
 8                                         Океания[en]
 9                                Северная Америка[en]
 10                                  Южная Америка[en]
 11                                               Иное
 12  Курсивом выделены непризнанные и частично приз...
 13            Лечебные и исследовательские учреждения
 14                               Последствия пандемии
 15                                         Персоналии

                                   Пандемия COVID-19.1
 0   заболевание COVID-19 профилактика вирус SARS-C...
 1   Кластер 5 Альфа Бета Гамма Дельта Эпсилон[en] ...
 2   Коваксин КовиВак Конвасэл Конвидеция Спутник V...
 3   .mw-parser-output .ts-navbox-plaintitle{font-s...
 4                        Пандемия COVID-19 по странам
 5   Азербайджан Армения Афганистан Бангладеш[en] Б...
 6   Алжир[en] Буркина-Фасо Бурунди Габон[en] Гамби...
 7   Австрия Албания Андорра Армения Азербайджан Бе...
 8   Австралия Вануату Кирибати Маршалловы Острова ...
 9   Антигуа и Барбуда Аруба[en] Белиз Гваделупа[en...
 10  Аргентина Боливия Бразилия (Амазонас) Венесуэл...
 11  Антарктика Круизные суда[en] Diamond Princess ...
 12  Курсивом выделены непризнанные и частично приз...
 13  Госпитальные суда[en] Центральная больница Уха...
 14  Конспирологические теории Вооружённые силы Здо...
 15  Марк ван Ранст Питер Дашак Ли Вэньлян Тедрос А...  ,
                         Пандемия COVID-19 по странам  \
 0                                           Азия[en]
 1                                         Африка[en]
 2                                         Европа[en]
 3                                        Океания[en]
 4                               Северная Америка[en]
 5                                  Южная Америка[en]
 6                                               Иное
 7  Курсивом выделены непризнанные и частично приз...

                       Пандемия COVID-19 по странам.1
 0  Азербайджан Армения Афганистан Бангладеш[en] Б...
 1  Алжир[en] Буркина-Фасо Бурунди Габон[en] Гамби...
 2  Австрия Албания Андорра Армения Азербайджан Бе...
 3  Австралия Вануату Кирибати Маршалловы Острова ...
 4  Антигуа и Барбуда Аруба[en] Белиз Гваделупа[en...
 5  Аргентина Боливия Бразилия (Амазонас) Венесуэл...
 6  Антарктика Круизные суда[en] Diamond Princess ...
 7  Курсивом выделены непризнанные и частично приз...  ]

In [5]:
URL = 'https://en.wikipedia.org/wiki/London'
dfs = pd.read_html(URL)

In [6]:
dfs

[                                               London  \
 0                                        Capital city
 1   Clockwise from top: City of London in the fore...
 2   .mw-parser-output .locmap .od{position:absolut...
 3   Coordinates: .mw-parser-output .geo-default,.m...
 4                                     Sovereign state
 5                                             Country
 6                                              Region
 7                                 Ceremonial counties
 8                          Local government districts
 9                                   Settled by Romans
 10                                         Government
 11                                             • Type
 12                                             • Body
 13                                  • London Assembly
 14                                    • UK Parliament
 15                                               Area
 16                                         • Total[A]
 17                                            • Urban
 18                                            • Metro
 19                                   • City of London
 20  • 32 London boroughs .mw-parser-output .nobold...
 21                                       Elevation[3]
 22              Population (2021 except where stated)
 23                                         • Total[A]
 24                                          • Density
 25                                  • Urban (2011)[4]
 26                                  • Metro (2019)[5]
 27                                   • City of London
 28                                           Demonyms
 29                                      GVA (2020)[6]
 30                                            • Total
 31                                       • Per capita
 32                                          Time zone
 33                                     • Summer (DST)
 34                                     Postcode areas
 35                                         Area codes
 36                                             Budget
 37                             International airports
 38                               Rapid transit system
 39                                             Police
 40                                          Ambulance
 41                                               Fire
 42                                             GeoTLD
 43                                            Website

                                              London.1
 0                                        Capital city
 1   Clockwise from top: City of London in the fore...
 2   .mw-parser-output .locmap .od{position:absolut...
 3   Coordinates: .mw-parser-output .geo-default,.m...
 4                                      United Kingdom
 5                                             England
 6                             London (Greater London)
 7   Greater London (ceremonial county) City of London
 8           32 London boroughs and the City of London
 9               AD 47; 1976 years ago[2] as Londinium
 10                                         Government
 11  Executive mayoralty and deliberative assembly ...
 12  Greater London Authority • Mayor Sadiq Khan (L...
 13                                  14 constituencies
 14                                  73 constituencies
 15                                               Area
 16                        606.96 sq mi (1,572.03 km2)
 17                          671.0 sq mi (1,737.9 km2)
 18                            3,236 sq mi (8,382 km2)
 19                              1.12 sq mi (2.89 km2)
 20                        605.85 sq mi (1,569.14 km2)
 21                                       36 ft (11 m)
 22              Population (2021 except where stated)
 23                                       8,799,800[1]
 24                           14,500/sq mi (5,598/km2)
 25                                            9787426
 26              14,257,962 (London metropolitan area)
 27                                           8,600[1]
 28                                           Londoner
 29                                      GVA (2020)[6]
 30                                       £504 billion
 31                                            £55,974
 32                          UTC (Greenwich Mean Time)
 33                        UTC+1 (British Summer Time)
 34  22 areas E, EC, N, NW, SE, SW, W, WC, BR, CM, ...
 35  9 area codes 020, 01322, 01689, 01708, 01737, ...
 36                   £19.376 billion ($25 billion)[7]
 37  Inside London: Heathrow (LHR)  City (LCY) Outs...
 38                                 London Underground
 39  Metropolitan (county of Greater London) City o...
 40                                             London
 41                                             London
 42                                            .london
 43                                  www.london.gov.uk  ,
                              Part of a series on the
                                    History of London
 0  Roman London Anglo-Saxon London Norman and Med...
 1                                           See also
 2                                           Timeline
 3                                      London portal
 4  .mw-parser-output .navbar{display:inline;font-...,
                                       London, England  \
                           Climate chart (explanation)
 0   J F M A M J J A S O N D  59  8 3  45  9 3  39 ...
 1                                                   J
 2                                             59  8 3
 3            Average max. and min. temperatures in °C
 4                          Precipitation totals in mm
 5   Imperial conversion JFMAMJJASOND  2.3  47 37  ...
 6                                 Imperial conversion
 7                                                   J
 8                                          2.3  47 37
 9            Average max. and min. temperatures in °F
 10                     Precipitation totals in inches

                           Unnamed: 1_level_0  \
                           Unnamed: 1_level_1
 0                                        NaN
 1                                          F
 2                                    45  9 3
 3   Average max. and min. temperatures in °C
 4                 Precipitation totals in mm
 5                                        NaN
 6                        Imperial conversion
 7                                          F
 8                                 1.8  48 37
 9   Average max. and min. temperatures in °F
 10            Precipitation totals in inches

                           Unnamed: 2_level_0  \
                           Unnamed: 2_level_1
 0                                        NaN
 1                                          M
 2                                   39  12 4
 3   Average max. and min. temperatures in °C
 4                 Precipitation totals in mm
 5                                        NaN
 6                        Imperial conversion
 7                                          M
 8                                 1.5  53 39
 9   Average max. and min. temperatures in °F
 10            Precipitation totals in inches

                           Unnamed: 3_level_0  \
                           Unnamed: 3_level_1
 0                                        NaN
 1                                          A
 2                                   42  15 6
 3   Average max. and min. temperatures in °C
 4                 Precipitation totals in mm
 5                                        NaN
 6                        Imperial conversion
 7                                          A
 8                                 1.7  59 43
 9   Average max. and min. temperatures in °F
 10            Precipitation totals in inches

                           Unnamed: 4_level_0  \
                           Unnamed: 4_level_1
 0                                        NaN
 1                                          M
 2                                   46  18 9
 3   Average max. and min. temperatures in °C
 4                 Precipitation totals in mm
 5                                        NaN
 6                        Imperial conversion
 7                                          M
 8                                 1.8  65 48
 9   Average max. and min. temperatures in °F
 10            Precipitation totals in inches

                           Unnamed: 5_level_0  \
                           Unnamed: 5_level_1
 0                                        NaN
 1                                          J
 2                                  47  22 12
 3   Average max. and min. temperatures in °C
 4                 Precipitation totals in mm
 5                                        NaN
 6                        Imperial conversion
 7                                          J
 8                                 1.9  71 54
 9   Average max. and min. temperatures in °F
 10            Precipitation totals in inches

                           Unnamed: 6_level_0  \
                           Unnamed: 6_level_1
 0                                        NaN
 1                                          J
 2                                  46  24 14
 3   Average max. and min. temperatures in °C
 4                 Precipitation totals in mm
 5                                        NaN
 6                        Imperial conversion
 7                                          J
 8                                 1.8  75 58
 9   Average max. and min. temperatures in °F
 10            Precipitation totals in inches

                           Unnamed: 7_level_0  \
                           Unnamed: 7_level_1
 0                                        NaN
 1                                          A
 2                                  53  23 14
 3   Average max. and min. temperatures in °C
 4                 Precipitation totals in mm
 5                                        NaN
 6                        Imperial conversion
 7                                          A
 8                                 2.1  74 57
 9   Average max. and min. temperatures in °F
 10            Precipitation totals in inches

                           Unnamed: 8_level_0  \
                           Unnamed: 8_level_1
 0                                        NaN
 1                                          S
 2                                  50  20 12
 3   Average max. and min. temperatures in °C
 4                 Precipitation totals in mm
 5                                        NaN
 6                        Imperial conversion
 7                                          S
 8                                   2  68 53
 9   Average max. and min. temperatures in °F
 10            Precipitation totals in inches

                           Unnamed: 9_level_0  \
                           Unnamed: 9_level_1
 0                                        NaN
 1                                          O
 2                                   65  16 9
 3   Average max. and min. temperatures in °C
 4                 Precipitation totals in mm
 5                                        NaN
 6                        Imperial conversion
 7                                          O
 8                                 2.6  60 48
 9   Average max. and min. temperatures in °F
 10            Precipitation totals in inches

                          Unnamed: 10_level_0  \
                          Unnamed: 10_level_1
 0                                        NaN
 1                                          N
 2                                   67  11 5
 3   Average max. and min. temperatures in °C
 4                 Precipitation totals in mm
 5                                        NaN
 6                        Imperial conversion
 7                                          N
 8                                 2.6  53 41
 9   Average max. and min. temperatures in °F
 10            Precipitation totals in inches

                          Unnamed: 11_level_0
                          Unnamed: 11_level_1
 0                                        NaN
 1                                          D
 2                                    57  9 3
 3   Average max. and min. temperatures in °C
 4                 Precipitation totals in mm
 5                                        NaN
 6                        Imperial conversion
 7                                          D
 8                                 2.2  48 38
 9   Average max. and min. temperatures in °F
 10            Precipitation totals in inches  ,
                                          0   \
 0                                         J
 1                                   59  8 3
 2  Average max. and min. temperatures in °C
 3                Precipitation totals in mm

                                          1   \
 0                                         F
 1                                   45  9 3
 2  Average max. and min. temperatures in °C
 3                Precipitation totals in mm

                                          2   \
 0                                         M
 1                                  39  12 4
 2  Average max. and min. temperatures in °C
 3                Precipitation totals in mm

                                          3   \
 0                                         A
 1                                  42  15 6
 2  Average max. and min. temperatures in °C
 3                Precipitation totals in mm

                                          4   \
 0                                         M
 1                                  46  18 9
 2  Average max. and min. temperatures in °C
 3                Precipitation totals in mm

                                          5   \
 0                                         J
 1                                 47  22 12
 2  Average max. and min. temperatures in °C
 3                Precipitation totals in mm

                                          6   \
 0                                         J
 1                                 46  24 14
 2  Average max. and min. temperatures in °C
 3                Precipitation totals in mm

                                          7   \
 0                                         A
 1                                 53  23 14
 2  Average max. and min. temperatures in °C
 3                Precipitation totals in mm

                                          8   \
 0                                         S
 1                                 50  20 12
 2  Average max. and min. temperatures in °C
 3                Precipitation totals in mm

                                          9   \
 0                                         O
 1                                  65  16 9
 2  Average max. and min. temperatures in °C
 3                Precipitation totals in mm

                                          10  \
 0                                         N
 1                                  67  11 5
 2  Average max. and min. temperatures in °C
 3                Precipitation totals in mm

                                          11
 0                                         D
 1                                   57  9 3
 2  Average max. and min. temperatures in °C
 3                Precipitation totals in mm  ,
                         Imperial conversion  \
 0                                         J
 1                                2.3  47 37
 2  Average max. and min. temperatures in °F
 3            Precipitation totals in inches

                       Imperial conversion.1  \
 0                                         F
 1                                1.8  48 37
 2  Average max. and min. temperatures in °F
 3            Precipitation totals in inches

                       Imperial conversion.2  \
 0                                         M
 1                                1.5  53 39
 2  Average max. and min. temperatures in °F
 3            Precipitation totals in inches

                       Imperial conversion.3  \
 0                                         A
 1                                1.7  59 43
 2  Average max. and min. temperatures in °F
 3            Precipitation totals in inches

                       Imperial conversion.4  \
 0                                         M
 1                                1.8  65 48
 2  Average max. and min. temperatures in °F
 3            Precipitation totals in inches

                       Imperial conversion.5  \
 0                                         J
 1                                1.9  71 54
 2  Average max. and min. temperatures in °F
 3            Precipitation totals in inches

                       Imperial conversion.6  \
 0                                         J
 1                                1.8  75 58
 2  Average max. and min. temperatures in °F
 3            Precipitation totals in inches

                       Imperial conversion.7  \
 0                                         A
 1                                2.1  74 57
 2  Average max. and min. temperatures in °F
 3            Precipitation totals in inches

                       Imperial conversion.8  \
 0                                         S
 1                                  2  68 53
 2  Average max. and min. temperatures in °F
 3            Precipitation totals in inches

                       Imperial conversion.9  \
 0                                         O
 1                                2.6  60 48
 2  Average max. and min. temperatures in °F
 3            Precipitation totals in inches

                      Imperial conversion.10  \
 0                                         N
 1                                2.6  53 41
 2  Average max. and min. temperatures in °F
 3            Precipitation totals in inches

                      Imperial conversion.11
 0                                         D
 1                                2.2  48 38
 2  Average max. and min. temperatures in °F
 3            Precipitation totals in inches  ,
    vteClimate data for London (LHR),[a] elevation: 25 m (82 ft), 1991–2020 normals  \
                                                                              Month
 0                                 Record high °C (°F)
 1                                Average high °C (°F)
 2                                  Daily mean °C (°F)
 3                                 Average low °C (°F)
 4                                  Record low °C (°F)
 5                   Average precipitation mm (inches)
 6               Average precipitation days (≥ 1.0 mm)
 7                       Average relative humidity (%)
 8                           Average dew point °C (°F)
 9                         Mean monthly sunshine hours
 10                          Percent possible sunshine
 11                          Average ultraviolet index
 12  Source 1: Met Office[194][195][196] Royal Neth...
 13  Source 2: Weather Atlas (percent sunshine and ...

                                                        \
                                                   Jan
 0                                         17.2 (63.0)
 1                                          8.4 (47.1)
 2                                          5.6 (42.1)
 3                                          2.7 (36.9)
 4                                         −16.1 (3.0)
 5                                         58.8 (2.31)
 6                                                11.5
 7                                                  80
 8                                              3 (37)
 9                                                61.1
 10                                                 23
 11                                                  1
 12  Source 1: Met Office[194][195][196] Royal Neth...
 13  Source 2: Weather Atlas (percent sunshine and ...


In [7]:
url = "https://ru.wikipedia.org/wiki/%D0%A1%D0%BF%D0%B8%D1%81%D0%BE%D0%BA_%D0%B3%D0%BE%D1%81%D1%83%D0%B4%D0%B0%D1%80%D1%81%D1%82%D0%B2"
df = pd.read_html(url, attrs={'class': 'wikitable'},
                  header=0, flavor='html5lib')

In [9]:
type(df)

list

In [11]:
df[0]

     Номер  Флаг       Страна                           Полное название страны
0        1   NaN    Австралия                               Австралийский Союз
1        2   NaN      Австрия                           Австрийская Республика
2        3   NaN  Азербайджан                       Азербайджанская Республика
3        4   NaN      Албания                               Республика Албания
4        5   NaN        Алжир    Алжирская Народная Демократическая Республика
..     ...   ...          ...                                              ...
188    189   NaN      Эфиопия  Федеративная Демократическая Республика Эфиопия
189    190   NaN          ЮАР                      Южно-Африканская Республика
190    191   NaN  Южный Судан                           Республика Южный Судан
191    192   NaN       Ямайка                                           Ямайка
192    193   NaN       Япония                               Государство Япония

[193 rows x 4 columns]

In [10]:
df

[     Номер  Флаг       Страна                           Полное название страны
 0        1   NaN    Австралия                               Австралийский Союз
 1        2   NaN      Австрия                           Австрийская Республика
 2        3   NaN  Азербайджан                       Азербайджанская Республика
 3        4   NaN      Албания                               Республика Албания
 4        5   NaN        Алжир    Алжирская Народная Демократическая Республика
 ..     ...   ...          ...                                              ...
 188    189   NaN      Эфиопия  Федеративная Демократическая Республика Эфиопия
 189    190   NaN          ЮАР                      Южно-Африканская Республика
 190    191   NaN  Южный Судан                           Республика Южный Судан
 191    192   NaN       Ямайка                                           Ямайка
 192    193   NaN       Япония                               Государство Япония

 [193 rows x 4 columns],
    Номер  Флаг     Страна     Полное название страны  \
 0      1   NaN    Ватикан  Государство-город Ватикан
 1      2   NaN  Палестина      Государство Палестина

   Дата получения статуса наблюдателя при ООН
 0                                   1964 год
 1                        29 ноября 2012 года  ,
    Год провозглашения независимости  \
 0                              1948
 1                              1948
 2                              1948
 3                              1949
 4                              1960
 5                              1990

                        Самоназвание государства    Население  \
 0                           Государство Израиль      9,4 млн
 1                              Республика Корея     51,7 млн
 2  Корейская Народно-Демократическая Республика     26,1 млн
 3                 Китайская Народная Республика  1 411,8 млн
 4                               Республика Кипр      1,3 млн
 5                            Республика Армения      3,0 млн

                                       Непризнанность
 0  Не признают 19 государств — членов ООН: Алжир,...
 1                                 Не признаётся КНДР
 2  Не признаётся Южной Кореей, Францией[1] и Япон...
 3  Не признают 13 государств — членов ООН и 1 гос...
 4                        Не признаётся Турцией[3][4]
 5    Не признаётся Пакистаном[5][6][7][8][9][10][11]  ,
    Номер  Флаг        Страна                         Полное название страны
 0      1   NaN       Абхазия                             Республика Абхазия
 1      2   NaN        Косово                              Республика Косово
 2      3   NaN     Палестина                          Государство Палестина
 3      4   NaN          САДР  Сахарская Арабская Демократическая Республика
 4      5   NaN       Тайвань                 Китайская Республика (Тайвань)
 5      6   NaN          ТРСК            Турецкая Республика Северного Кипра
 6      7   NaN  Южная Осетия                        Республика Южная Осетия,
    Номер  Флаг      Страна                 Полное название страны
 0      1   NaN         НКР         Нагорно-Карабахская Республика
 1      2   NaN         ПМР  Приднестровская Молдавская Республика
 2      3   NaN  Сомалиленд                  Республика Сомалиленд,
    Номер  Флаг        Страна Полное название страны
 0      1   NaN          Ниуэ                   Ниуэ
 1      2   NaN  Острова Кука           Острова Кука]